'''C5. Асан мен Үсен
time limit per test0.25 seconds
memory limit per test4 megabytes
Ағайынды 6-7 жасар Асан мен Үсен ата-анасынан өз қалаған сыйлықтарын алыпты. Асан электронды қол сағатты алса, ал Үсен секундомерді сұраған екен.

Бірде екеуі қолдағы құралдарымен уақытша алмасуға келісіпті, яғни енді Асанда секундомер, ал Үсенде қол сағат. Сөйтсе, Асан қол сағатынан ұзаққа ажырағысы келмегеннен, бірден n секундтан кейін кері алмасамыз депті.

Оны мақұлдаған Үсен, электронды сағаты қандай уақытты көрсеткенде кері қайтару керегін білгісі келіп, сізден көмек сұрауда.

Input
Бірінші жолда Үсенде көрсетіліп тұрған қазіргі электронды уақыт HH:MM:SS форматында беріледі. Ал екінші жолда Асан айтқан n уақыт беріледі.

Output
Қайтару керек уақытын көрсет.

Examples
inputСкопировать
12:10:00
10
outputСкопировать
12:10:10
inputСкопировать
13:11:26
122
outputСкопировать
13:13:28'''
h,m,s=map(int,input().split(":"))
n=int(input())
tot=(h*3600)+(m*60)+s+n
tot%=86400
h1=tot//3600
m1=(tot%3600)//60
s1=tot%60
print(f"{h1:02d}:{m1:02d}:{s1:02d}")
